
# State **`s3://infrahouse-github-control-state/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |        2 |           1 |          0 |
## Affected resources by action

|  Action  | Resources                                                             |
|:--------:|:----------------------------------------------------------------------|
|    🟢    | `module.repos["terraform-aws-cost-alert"].github_repository.repo`     |
|    🟢    | `module.repos["terraform-aws-cost-alert"].github_team_repository.dev` |
|    🟡    | `module.repos["terraform-aws-cloud-init"].github_repository.repo`     |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repos["terraform-aws-cloud-init"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ description                 = "Module that creates an cloud init configuration for an InfraHouse EC2 instance." -> "Module that creates a cloud init configuration for an InfraHouse EC2 instance."
        id                          = "terraform-aws-cloud-init"
        name                        = "terraform-aws-cloud-init"
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["terraform-aws-cost-alert"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Module that creates a alert for AWS cost per period."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "terraform-aws-cost-alert"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = true

      + security_and_analysis (known after apply)
    }

  # module.repos["terraform-aws-cost-alert"].github_team_repository.dev will be created
  + resource "github_team_repository" "dev" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "terraform-aws-cost-alert"
      + team_id    = "7332815"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGUvdGVycmFmb3JtLnRmc3RhdGUiOiB7InN1Y2Nlc3MiOiB0cnVlLCAiYWRkIjogMiwgImNoYW5nZSI6IDEsICJkZXN0cm95IjogMH19
```
</details>